Data Science Project

Car Price Prediction

https://www.kaggle.com/code/mohamedahmed10000/car-price-prediction-with-accuracy-94-4

In [16]:
import pandas as pd 
import numpy as np 
import seaborn as sns 
from sklearn.impute import SimpleImputer

In [17]:
df = pd.read_csv("CarPrediction.csv")
df.sample(6)

,Unnamed: 0,Unnamed: 0.1,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,Price,Brand
1846,1884,1884,Honda Jazz,Kochi,2017,24700,Petrol,Manual,First,18.70,1199,88.70,5,7.07,Honda
3707,3780,3780,Mahindra Xylo,Pune,2013,167362,Diesel,Manual,First,11.68,2498,112.00,7,4.00,Mahindra
4112,4192,4192,Hyundai i10,Delhi,2013,53213,Petrol,Manual,First,19.81,1086,68.05,5,2.74,Hyundai
2841,2899,2899,Mahindra XUV500,Kolkata,2017,14600,Diesel,Manual,First,16.00,2179,140.00,7,14.50,Mahindra
374,384,384,Mercedes-Benz E-Class,Bangalore,2017,33900,Diesel,Automatic,First,15.00,2143,204.00,5,37.00,Mercedes-Benz
3516,3583,3583,Hyundai Verna,Mumbai,2011,58000,Petrol,Manual,Second,17.01,1591,121.30,5,4.00,Hyundai

In [9]:
#Step 1: Data Cleaning and Feature Engineering
df.shape

(5912, 15)

In [11]:
type(df.columns)
df.dtypes

Unnamed: 0             int64
Unnamed: 0.1           int64
Name                  object
Location              object
Year                   int64
Kilometers_Driven      int64
Fuel_Type             object
Transmission          object
Owner_Type            object
Mileage              float64
Engine                 int64
Power                float64
Seats                  int64
Price                float64
Brand                 object
dtype: object

In [12]:
df.describe()

,Unnamed: 0,Unnamed: 0.1,Year,Kilometers_Driven,Mileage,Engine,Power,Seats,Price
count,5912.000000,5912.000000,5912.000000,5.912000e+03,5912.000000,5912.000000,5912.000000,5912.00000,5912.000000
mean,3012.791272,3012.791272,2013.450609,5.837766e+04,18.231778,1622.857070,113.014026,5.28180,9.584919
std,1735.810485,1735.810485,3.188638,9.189848e+04,4.431628,600.877459,53.797403,0.80269,11.233694
min,0.000000,0.000000,1998.000000,1.710000e+02,0.000000,72.000000,34.200000,2.00000,0.440000
25%,1510.750000,1510.750000,2012.000000,3.351275e+04,15.260000,1198.000000,75.000000,5.00000,3.500000
50%,3013.500000,3013.500000,2014.000000,5.286250e+04,18.200000,1493.000000,94.000000,5.00000,5.700000
75%,4515.250000,4515.250000,2016.000000,7.245375e+04,21.100000,1984.000000,138.100000,5.00000,10.012500
max,6018.000000,6018.000000,2019.000000,6.500000e+06,33.540000,5998.000000,560.000000,10.00000,160.000000

In [19]:
df.drop_duplicates(inplace=True)

In [20]:
df.drop("Unnamed: 0.1", axis=1, inplace=True)

In [21]:
null_col = ['Mileage', 'Engine' , 'Power','Seats']

imputer = SimpleImputer(strategy='most_frequent')
df[null_col] = imputer.fit_transform(df[null_col])

In [22]:
df = df.convert_dtypes()

In [23]:
missing_values_count = df.isnull().sum()
missing_values_count[0:10]

Unnamed: 0           0
Name                 0
Location             0
Year                 0
Kilometers_Driven    0
Fuel_Type            0
Transmission         0
Owner_Type           0
Mileage              0
Engine               0
dtype: int64

In [ ]:
#Step 2: Data Understanding/Data Visualization
#-Visualization of Numerical Columns and Outliers
#-Boxplot? maybe for central tendacy?

In [ ]:
#Step 3: Data Pre-Processing
#-Transformation and Spliting

In [ ]:
#Step 4: Modeling
#-Linear Regression by using differnt methods to find the best accuracy

In [ ]:
#Step 6: TensorFlow-- Keras?
#This part is optional but this part is for me assigned by Dr. Boukari